[
	{"author":"elena_pastukhova","author_link":"https://habr.com/ru/users/elena_pastukhova/","link":"https://habr.com/ru/company/geltek/blog/540524/","preview":"\n      \nОдно из возможных проявлений атопического дерматита\n\nЗнаете, чему учат студентов-медиков, когда они в первый раз попадают на курацию по кожно-венерологическим заболеваниям? Правильно общаться с пациентом и корректно его осматривать. Типичный студент, увидевший кожу с неприглядными корочками или покраснениями, сразу отодвигается на полтора метра и делает круглые глаза. А потом чуть ли не палочкой пытается тыкать в пациента, стараясь не приближаться. Людей это расстраивает, особенно с учётом того, что большинство пациентов там вовсе не болеет чем-то страшным и заразным.\n\nЧасто попадаются довольно неприятно выглядящие хронические заболевания, которые радикально не лечатся, но поддаются контролю при правильном подходе. Псориаз или атопический дерматит очень сложно лечить из-за двух причин:\n\n\nБазовая причина связана с генетическими дефектами, которые мы пока не можем чинить, несмотря на все успехи генотерапии.\nЕсть куча непонятных факторов, которые могут запускать этот процесс.\n\nВ итоге можно попытаться загнать заболевание в постоянную ремиссию. Сегодня мы поговорим:\n\n\nЧто это за патология, с которой сталкивается около 20 % людей.\nЧто ломается в организме у атопиков.\nКак это связано с аллергией.\nЧто лучше мазать на кожу.\nПочему антидепрессанты могут сильно помочь.\n\nПод катом будет несколько фотографий повреждённой кожи, но не ужас-ужас, как вы и просили.\n    ","publication_date":"сегодня в 14:01","title":"Атопический дерматит (нейродермит): что сломалось и как лечить","views":"9,7k"},
	{"author":"ruvds","author_link":"https://habr.com/ru/users/ruvds/","link":"https://habr.com/ru/company/ruvds/blog/540502/","preview":"\n       \nDid he ever return? No, he never returned,\nAnd his fate is still unlearned,\nHe may ride forever ‘neath the streets of Boston,\nHe’s the man who never returned.\n\n“Charlie on the M.T.A.”, 1949\n\n1. Замыкания\nОдна из удобных возможностей современных языков программирования – вложенные функции:\n\ndef bubble(arr, comp):\n\n    def swap(i, j):\n        temp = arr[i]\n        arr[i] = arr[j]\n        arr[j] = temp\n\n    flag = True\n    while flag:\n        flag = False\n        for i in range(len(arr) - 1):\n            if comp(arr[i], arr[i+1]) > 0:\n                swap(i, i+1)\n                flag = True\n\nСама эта возможность не нова: она была уже в Алголе (1958) и многим знакома из Паскаля (1970). В компиляции вложенных функций нет ничего сложного: например, в стековом кадре внутренней функции может храниться указатель на стековый кадр внешней функции, чтобы внутренняя функция могла обращаться к параметрам и локальным переменным внешней. Кто-то может вспомнить, что инструкции enter и leave, появившиеся в 80186 (1982), реализуют именно такую поддержку вложенных функций (хотя я не встречал ни один компилятор, который бы её задействовал).\n\nСложности начинаются, если язык позволяет передать внутреннюю функцию наружу внешней:\n\ndef by_field(name):\n\n    def comp(x, y):\n        return x[name] – y[name]\n\n    return comp\n\nbubble(my_records, by_field(\"year\"))\n\nКак внутренняя функция сможет обращаться к параметрам и локальным переменным внешней после того, как возврат из внешней функции уничтожил её стековый кадр? Каким-то образом внутренняя функция должна «захватить» используемые переменные вместе с собой; функция вместе с захваченными извне переменными называется «замыканием». Паскаль такое уже не поддерживает;\n    ","publication_date":"сегодня в 12:28","title":"Cheney on the M.T.A.: компилятор, в котором стек служит заодно и кучей","views":"1,3k"},
	{"author":"NFedotova","author_link":"https://habr.com/ru/users/NFedotova/","link":"https://habr.com/ru/company/lanit/blog/539040/","preview":"\n      Один из самых простых способов утечки информации, который нередко упускают из виду, – когда конфиденциальные данные получают с экрана монитора. Особенно если рабочее место сотрудника расположено в офисах открытого типа, также известных как open space. \n\nВ этой статье я расскажу о результатах экспериментов, которые провела наша команда в ЛАНИТ. Мы проверили, насколько эффективен такой способ защиты данных, как экран защиты информации от компании 3М, и рассмотрели несколько сценариев, при которых чувствительная информация может попасть в поле внешнего наблюдения (коллег или посторонних). Подробнее о том, что показало исследование, – в материале под катом.\n\nИсточник \n    ","publication_date":"сегодня в 10:06","title":"Как защитить информацию на экране монитора от утечки","views":"7,6k"},
	{"author":"Ioanlarionov","author_link":"https://habr.com/ru/users/Ioanlarionov/","link":"https://habr.com/ru/post/539310/","preview":"","publication_date":"сегодня в 12:50","title":"Время-деньги. Сколько стоит час инженера","views":"11k"},
	{"author":"kmkuprienko","author_link":"https://habr.com/ru/users/kmkuprienko/","link":"https://habr.com/ru/company/flant/blog/540406/","preview":"","publication_date":"сегодня в 12:18","title":"Почему в InVision затаскивают микросервисы обратно в монолит","views":"5,9k"},
	{"author":"HamsterTime","author_link":"https://habr.com/ru/users/HamsterTime/","link":"https://habr.com/ru/post/540176/","preview":"","publication_date":"сегодня в 10:34","title":"Плазма на ламповой голове","views":"4,1k"},
	{"author":"mors741","author_link":"https://habr.com/ru/users/mors741/","link":"https://habr.com/ru/company/yandex/blog/539960/","preview":"\n      Привет, меня зовут Женя. Сегодня я расскажу, что такое квантование эмбеддингов, какие бывают способы квантования и как с их помощью мы в Яндекс.Дзене смогли сократить использование памяти, рейта записи и сетевого трафика в четыре раза. Будет совсем немного математики, умеренно размышлений о machine learning, highload и big data и много разноцветных картинок.\n\nЧто такое эмбеддинги?\nЭмбеддинг — числовой вектор, который каким-то (в общем случае непонятным на глаз) образом характеризует интересы пользователя или контент. Например, эмбеддинги могут быть такими.\n\n\n\nУ каждого пользователя и карточки может быть несколько эмбеддингов разных типов. В основном используются два вида эмбеддингов.\n    ","publication_date":"сегодня в 10:41","title":"Квантование эмбеддингов: что это, зачем оно нужно и как его правильно готовить","views":"2,1k"},
	{"author":"vdsina_m","author_link":"https://habr.com/ru/users/vdsina_m/","link":"https://habr.com/ru/company/vdsina/blog/540478/","preview":"\n      \nВ мире, где роутеры всё больше напоминают перевёрнутых пауков, чем предметы, которые бы хотелось видеть в своей гостиной, есть только несколько устройств, которые можно было бы назвать «знаменитыми». Примерами подобного могут быть AirPort Стива Джобса и mesh-роутеры Eero. Но лавры победителя в этой категории получает модель роутера Linksys, которой уже исполнилось почти 20 лет, и всё благодаря изначально незадокументированной особенности, ставшей чрезвычайно популярной у определённой пользовательской базы. Сегодня мы поговорим о сине-чёрном образце маршрутизатора беспроводного доступа — Linksys WRT54G. Именно этот роутер показал миру, на что должны быть способны беспроводные маршрутизаторы.\n\n1988 год\nLinksys был основан двумя иммигрантами из Тайваня Джени и Виктором Цао в 1988 году. По информации в профиле 2004 года на Inc., компания задумывалась как посредник между изобретателями и производителями на рынке Тайваня, но в 1990-х сама занялась производством оборудования, со временем придя к рынку домашних сетей и начав доминировать на нём в начале 2000-х.\n    ","publication_date":"сегодня в 11:15","title":"Linksys WRT54G — роутер, случайно ставший легендарным","views":"10,4k"},
	{"author":"ru_vds","author_link":"https://habr.com/ru/users/ru_vds/","link":"https://habr.com/ru/company/ruvds/blog/539096/","preview":"\n      Объектная модель документа (Document Object Model, DOM) — это интерфейс, который рассматривает HTML- или XML-документы в виде древовидных структур, каждый узел которых является объектом документа. DOM, кроме того, предоставляет набор методов для выполнения запросов к дереву документа, для изменения его структуры и для выполнения с ним некоторых других действий.\n\n\n\nПри работе с DOM, кроме того, используется термин «элемент». Элементы очень похожи на узлы, но, всё же, это — не одно и то же. В чём же разница?\n    ","publication_date":"сегодня в 17:51","title":"В чём разница между узлом и элементом DOM?","views":"2,1k"},
	{"author":"Tsar111","author_link":"https://habr.com/ru/users/Tsar111/","link":"https://habr.com/ru/company/croc/blog/539974/","preview":"","publication_date":"сегодня в 10:00","title":"Как мы перенесли управление инженерными системами в облако и сэкономили заправке 20% электроэнергии","views":"1,7k"},
	{"author":"Igor_Le","author_link":"https://habr.com/ru/users/Igor_Le/","link":"https://habr.com/ru/company/postgrespro/blog/537988/","preview":"\n      \n\nПривет всем уже в 21-м году. Надеемся, он будет добрей к нам, чем прошлый. Жизнь продолжается. И мы продолжаем знакомить вас с самыми интересными новостями PostgreSQL. Для разнообразия начну с конференций: этот жанр больше всего пострадал.\n\nКонференции\nОрганизаторы конференций выбирают разные стратегии в условиях карантина. Самый простой — отменить, но лучше чем-то компенсировать.\n\nNordic PGDay 2021\n\nОтменена. Рассчитывают на Хельсинки в марте 2022. Виртуального варианта не будет, но собираются сфокусироваться на PostgreSQL-треке FOSDEM 2021 в феврале. На сайте написано 2022, но имеется в виду, судя по всему FOSDEM 2021, о котором ниже.\n\nА вот подход Highload++. Бескомпромиссный — никакого онлайна:\nHighload++ 2020 (2021)\n\nКонференцию HighLoad++ не стали переносить в онлайн — решили, что она для этого слишком масштабная. Но даты передвинули с 9-10 ноября 2020 г. на 20-21 мая 2021 года. Должна пройти в Москве в «Крокус Экспо 3».\n\nА вот полная противоположность:\nFOSDEM 2021\n\nНикакого Брюсселя, в 2021 только онлайн. Не только бесплатно, но и регистрации даже не требуется. Среди участников этой огромной конференции немало докладчиков, известных среди российских постгресистов: Олег Бартунов, Павел Борисов, Алексей Кондратов, Анастасия Лубенникова, Никита Глухов (Postgres Professional), Николай Самохвалов (Postgres.ai), Пётр Зайцев (Percona), Андрей Бородин (Yandex), Олег Иванов (Samsung AI Center, он автор плагина AQO в Postgres Pro Enterprise). \nРасписание можно попробовать изучить здесь. Поток PostgreSQL здесь.\n\nPGConf.Online 2021\n    ","publication_date":"сегодня в 03:48","title":"Postgresso 28","views":"1,8k"},
	{"author":"splarv","author_link":"https://habr.com/ru/users/splarv/","link":"https://habr.com/ru/company/domclick/blog/534896/","preview":"\n      PostgreSQL хранит данные на каких-то носителях. И между PostgreSQL и, например, магнитной поверхностью диска находится несколько кешей: кеш самого винчестера, кеш RAID-контроллера или винчестерной полки, кеш файловой системы на уровне операционной системы и кеш самого PostgreSQL. Если первыми перечисленными кешами мы практический не можем управлять, то последними, находящимися в ОЗУ сервера, управлять можем: например, выделяя больше ОЗУ под кеш PostgreSQL в ущерб кешу ОС, или наоборот. В официальной документации можно прочитать ничем не подтвержденные рекомендации, типа выделять под PostgreSQL четверть ОЗУ. Это вызывает сомнения. PostgreSQL в виде Postgres95 впервые появился в 1995 году и, кто знает, быть может и эти рекомендации относятся к тому же году. Поэтому появилась идея эксперимента с целью разобраться, как лучше распределять ОЗУ.\n    ","publication_date":"сегодня в 12:11","title":"Кеш бывает разным","views":"2,3k"},
	{"author":"Pixonic","author_link":"https://habr.com/ru/users/Pixonic/","link":"https://habr.com/ru/company/pixonic/blog/540544/","preview":"\n      Представьте себе: вот вы ждете новую часть вашей любимой игры и, наконец, она выходит. Специально под это дело вы обновили свой ПК: установили новейшие ЦП и ГП, увеличили объем оперативки и даже заменили жесткий диск на SSD. Теперь игра должна запускаться у вас гладко, как шелк, с первого же экрана загрузки и до самого конца.\n\nВот вы скачиваете себе ранее оплаченный предзаказ. Завершается установка, вы запускаете игру. Все идет хорошо: игра «летает» с частотой кадров 60 FPS. Или, во всяком случае, так говорит вам счетчик кадров в оверлее вашего ГП. Но что-то идет не так. Вы водите мышкой туда-сюда и замечаете, что игра… фризится. \n\nКак это возможно? Какие еще фризы при 60 FPS?\n\nЭто может казаться смешным до тех пор, пока не столкнешься с этим сам. Если вы встречались с такими фризами, то наверняка уже успели их возненавидеть. \n\nЭто не лаги. Не низкий фреймрейт. Это статтеринг. При высоких FPS и идеальной сверхбыстрой конфигурации. \n\nЧто это такое, откуда взялось и есть ли способ от него избавиться? Сейчас разберемся.\n\n\n\n    ","publication_date":"сегодня в 15:15","title":"Ста-ста-статтеринг, или откуда в игре берутся микрофризы и как с ними бороться","views":"2,4k"},
	{"author":"Axelus","author_link":"https://habr.com/ru/users/Axelus/","link":"https://habr.com/ru/company/regionsoft/blog/540554/","preview":"","publication_date":"сегодня в 15:29","title":"CRM — это не…","views":"1,5k"},
	{"author":"mvideo","author_link":"https://habr.com/ru/users/mvideo/","link":"https://habr.com/ru/company/mvideo/blog/540510/","preview":"\n      \n\nБыть просто продавцом бытовой техники, банком или пиццерией стало немодно. Традиционный, успешный бизнес стремится отойти от былых побед, устремившись на скоростной поезд до станции «цифровое будущее». Группа «М.Видео-Эльдорадо» в этом смысле не исключение. \n\nСпоры о том, победит ли онлайн традиционные форматы бизнеса, ведутся уже лет 20, и пандемия только разогрела дебаты. Да, мы чаще заказываем еду для себя и кота домой, но и потребность потестить ноутбук или смартфон перед покупкой тоже осталась. Удобно, когда сервис «бесшовный» – выбрал в приложении, посмотрел в магазине, кликнул, оплатил, получил. Гибридные модели, объединяющие и онлайн, и реальную жизнь, на пике роста в самых разных сферах — обучении, ритейле, медицине, финансах. \n\nКакие ИТ-разработки и экспертиза нужны гибридным бизнесам, почему нельзя взять и закрыть магазины и как это связано с инновациями, рассказывает директор по цифровой трансформации Группы «М.Видео-Эльдорадо» Виктория Кунина.\n    ","publication_date":"сегодня в 16:49","title":"Группа «М.Видео-Эльдорадо»: в 2021 году нам нужно еще 600 программистов","views":"6,8k"},
	{"author":"GeorgyNSK","author_link":"https://habr.com/ru/users/GeorgyNSK/","link":"https://habr.com/ru/post/540542/","preview":"\n      \n\nВ прошлый раз я писал о проекте глобального изменения климата планеты Петра Борисова. Но справедливости ради, такие масштабные и, на первый взгляд, экзотические проекты рождались не только у советских ученых. Например, перед Второй мировой войной в Европе прозвучала идея осушения значительной части Средиземного моря. Подробности — под катом.\n    ","publication_date":"сегодня в 15:09","title":"Осушить Средиземное море","views":"6,1k"},
	{"author":"PatientZero","author_link":"https://habr.com/ru/users/PatientZero/","link":"https://habr.com/ru/post/538952/","preview":"\n      \nПри разработке видеоигр часто встречается задача вычисления угла выстрела для попадания в цель. Она настолько распространена, что я писал код для её решения в буквальном смысле для каждой игры, над которой работал.\n\nКогда возникала эта проблема, я обычно брал ручку с блокнотом и решал её с нуля. Мне это надоело. Чтобы сэкономить себе из будущего немного времени, я выложу это решение в Интернет. Кроме того, я расскажу о необычной «фишке», которую предпочитаю использовать из соображений эстетики.\n\nУравнения движения\nЗадача всегда начинается одинаково. У нас есть стреляющий и цель: под каким углом нужно стрелять снарядом, чтобы он поразил цель?\n\nСуществует четыре основных уравнения движения. В статье мы воспользуемся только одним.\n    ","publication_date":"сегодня в 10:50","title":"Вычисляем баллистические траектории в играх","views":"3,9k"},
	{"author":"romas1982","author_link":"https://habr.com/ru/users/romas1982/","link":"https://habr.com/ru/company/oleg-bunin/blog/537184/","preview":"","publication_date":"сегодня в 10:00","title":"Как компании отказаться от роли тимлидов","views":"3,6k"},
	{"author":"SolarSecurity","author_link":"https://habr.com/ru/users/SolarSecurity/","link":"https://habr.com/ru/company/solarsecurity/blog/540368/","preview":"\n      В прошлом году мы выпустили мажорную версию своего продукта Solar Dozor 7. В новую версию нашей DLP-системы вошел модуль продвинутого анализа поведения пользователей UBA. При его создании мы попробовали разные базы данных, но по совокупности критериев (о них скажем ниже) в итоге остановились на ClickHouse.\n\nОсвоить ClickHouse местами было непросто, многое стало для нас откровением, но главное преимущество этой СУБД затмевает все её недостатки. Как вы поняли из заголовка, речь о скорости. По этому параметру ClickHouse оставляет далеко позади традиционные коммерческие базы данных, которые мы в своих продуктах, в том числе в Solar Dozor, тоже используем.\n\nВ общем, если вы давно хотели, но никак не решались попробовать, изучите наш опыт, он может вам пригодиться.\n\n\nКадры из мультфильма «Турбо» (2013 год)\n    ","publication_date":"сегодня в 10:00","title":"Вот это скорость! Как мы подружили наш UBA-модуль с ClickHouse и что из этого вышло","views":"1,5k"},
	{"author":"Darksa","author_link":"https://habr.com/ru/users/Darksa/","link":"https://habr.com/ru/company/selectel/blog/540560/","preview":"\n      \nМечта об управлении компьютером силой мысли вот уже более полувека будоражит умы людей. Еще с 1960 года специалисты DARPA рассматривали возможность симбиоза человека и компьютера. Казалось бы, задачка элементарная: считать электрический сигнал от мозга, сформировать на его основе команду и исполнить ее на компьютере. Но даже на первом этапе возникают очень большие сложности. Дело в том, что сигнал от мозга настолько слабый, что его требуется усиливать почти в 20000 раз.\n\nСобрать такую схему сейчас не проблема, но тут возникает еще один существенный нюанс. Для того, чтобы снять полезный сигнал с кожи головы, необходима как можно большая площадь контакта датчиков. При малой площади контакта неизбежно начнут возникать проблемы из-за резкого увеличения сопротивления. Полезный сигнал просто не будет различим на фоне шумов.\n    ","publication_date":"сегодня в 17:00","title":"NextMind Dev Kit: обзор первого нейроинтерфейса реального времени","views":"1,9k"},
